#include <iostream>
#include <string>

using namespace std;

int menu(){
    int choice;
    cout << endl << "....................................................................." << endl;
    cout << "Выберите действие:";
    cout << "0 - Выйти из программы." << endl;
    cout << "1 - Задать кривую." << endl;
    cout << "2 - Расстояние до центра в полярной системе координат, в зависимости от угла." << endl;
    cout << "3 - Радиус кривизны." << endl;
    cout << "4 - Площадь полярного сектора лемнискаты в зависимости от угла полярного радиуса." << endl;
    cout << "5 - Площадь лемнискаты." << endl;
    cout << endl << "....................................................................." << endl;
    do{
        cin >> choice;
    }while(isdigit(choice) == true && 0 <= choice <= 5 );
    return choice;
}
